System.register(['../../../app/common/list-pager/list-pager.component', 'angular2/http/testing', 'angular2/core', 'angular2/http'], function(exports_1) {
    var list_pager_component_1, testing_1, core_1, http_1;
    return {
        setters:[
            function (list_pager_component_1_1) {
                list_pager_component_1 = list_pager_component_1_1;
            },
            function (testing_1_1) {
                testing_1 = testing_1_1;
            },
            function (core_1_1) {
                core_1 = core_1_1;
            },
            function (http_1_1) {
                http_1 = http_1_1;
            }],
        execute: function() {
            describe('ListPager', function () {
                var http, backend, connection;
                var responseBody = {
                    items: [
                        {
                            _id: 1,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 2,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 3,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 4,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 5,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 6,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 7,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 8,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 9,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 10,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 11,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 12,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 13,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 14,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 15,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 16,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 17,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 18,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 19,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 20,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }
                    ],
                    total: 20
                };
                beforeEach(function (done) {
                    var injector = core_1.Injector.resolveAndCreate([
                        testing_1.MockBackend,
                        core_1.provide(http_1.Http, {
                            useFactory: function (backend) { return new http_1.Http(backend, new http_1.BaseRequestOptions()); },
                            deps: [testing_1.MockBackend]
                        })
                    ]);
                    http = injector.get(http_1.Http);
                    backend = injector.get(testing_1.MockBackend);
                    backend.connections.subscribe(function (c) { return connection = c; });
                    done();
                });
                it('has default values', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    expect(listPager.currentPage).toEqual(1);
                    expect(listPager.itemsPerPage).toEqual(10);
                    expect(listPager.itemsTotal).toEqual(0);
                    expect(listPager.items.length).toEqual(0);
                    expect(listPager.visiblePagesMax).toEqual(5);
                    done();
                });
                it('should load 1st page on ngOnInit', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.onItemsLoad = function (items, total) {
                        expect(items.length).toBe(10);
                        expect(total).toBe(20);
                        expect(listPager.currentPage).toBe(1);
                        expect(listPager.pagesTotal).toBe(2);
                        expect(listPager.visiblePages.length).toBe(2);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should load 2nd page', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 2;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function (items, total) {
                        expect(items.length).toBe(2);
                        expect(total).toBe(20);
                        expect(listPager.currentPage).toBe(2);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should load last page', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 10;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function (items, total) {
                        expect(items.length).toBe(2);
                        expect(items[0]._id).toBe(19);
                        expect(total).toBe(20);
                        expect(listPager.currentPage).toBe(10);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should limit visible pages to maxVisiblePages if more', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 1;
                    listPager.itemsPerPage = 2;
                    listPager.visiblePagesMax = 5;
                    listPager.onItemsLoad = function (items, total) {
                        expect(listPager.pagesTotal).toBe(10);
                        expect(listPager.visiblePages.length).toEqual(listPager.visiblePagesMax);
                        expect(listPager.visiblePages[0]).toEqual(1);
                        expect(listPager.visiblePages[listPager.visiblePagesMax - 1]).toEqual(listPager.visiblePagesMax);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should limit visible pages to maxVisiblePages and start with previous when go to page', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 4;
                    listPager.itemsPerPage = 2;
                    listPager.visiblePagesMax = 5;
                    listPager.onItemsLoad = function (items, total) {
                        expect(listPager.pagesTotal).toBe(10);
                        expect(listPager.visiblePages.length).toEqual(listPager.visiblePagesMax);
                        expect(listPager.visiblePages[0]).toEqual(2);
                        expect(listPager.visiblePages[listPager.visiblePagesMax - 1]).toEqual(6);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should limit visible pages to maxVisiblePages for last page', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 10;
                    listPager.itemsPerPage = 2;
                    listPager.visiblePagesMax = 5;
                    listPager.onItemsLoad = function (items, total) {
                        expect(listPager.pagesTotal).toBe(10);
                        expect(listPager.visiblePages.length).toEqual(listPager.visiblePagesMax);
                        expect(listPager.visiblePages[0]).toEqual(6);
                        expect(listPager.visiblePages[listPager.visiblePagesMax - 1]).toEqual(10);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should switch to the prev page if current page > 1', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 2;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function () {
                        listPager.onPageChange = function (newPage) {
                            expect(newPage).toBe(1);
                            done();
                        };
                        listPager.goToPrev();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it('should switch to the next page if current page < last', function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 1;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function (items, total) {
                        listPager.onPageChange = function (newPage) {
                            expect(newPage).toBe(2);
                            done();
                        };
                        listPager.goToNext();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it("shouldn't switch to prev page if current page == 1", function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 1;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function () {
                        listPager.onPageChange = function (newPage) {
                            //this code must not be called
                            expect(false).toBeTruthy();
                        };
                        listPager.goToPrev();
                        expect(listPager.currentPage).toBe(1);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it("shouldn't switch to next page if current page == last", function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 10;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function () {
                        listPager.onPageChange = function (newPage) {
                            //this code must not be called
                            expect(false).toBeTruthy();
                        };
                        listPager.goToNext();
                        expect(listPager.currentPage).toBe(10);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it("should go to the page if number is valid", function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 3;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function (items, total) {
                        listPager.onPageChange = function (newPage) {
                            expect(newPage).toBe(4);
                            done();
                        };
                        listPager.goToPage(4);
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it("shouldn't go to the page if number is greater then last index", function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 5;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function () {
                        listPager.onPageChange = function (newPage) {
                            //this code must not be called
                            expect(false).toBeTruthy();
                        };
                        listPager.goToPage(20);
                        expect(listPager.currentPage).toBe(5);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it("shouldn't go to the page if number is less then 1", function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 5;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function () {
                        listPager.onPageChange = function (newPage) {
                            //this code must not be called
                            expect(false).toBeTruthy();
                        };
                        listPager.goToPage(0);
                        expect(listPager.currentPage).toBe(5);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
                it("shouldn't go to the page if number is not integer", function (done) {
                    var listPager = new list_pager_component_1.ListPagerComponent(http);
                    listPager.source = new http_1.Request({ url: 'data/news' });
                    listPager.currentPage = 5;
                    listPager.itemsPerPage = 2;
                    listPager.onItemsLoad = function () {
                        listPager.onPageChange = function (newPage) {
                            //this code must not be called
                            expect(false).toBeTruthy();
                        };
                        listPager.goToPage('text');
                        expect(listPager.currentPage).toBe(5);
                        done();
                    };
                    listPager.ngOnInit();
                    connection.mockRespond(new http_1.Response(new http_1.BaseResponseOptions().merge({
                        body: responseBody
                    })));
                });
            });
        }
    }
});
//# sourceMappingURL=list-pager.spec.js.map