System.register(['../../../../app/common/list/pager.component'], function(exports_1) {
    var pager_component_1;
    return {
        setters:[
            function (pager_component_1_1) {
                pager_component_1 = pager_component_1_1;
            }],
        execute: function() {
            describe('Pager', function () {
                var page = {
                    items: [
                        {
                            _id: 1,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 2,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 3,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 4,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 5,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 6,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 7,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 8,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        },
                        {
                            _id: 9,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 10,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 11,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 12,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 13,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 14,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 15,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 16,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 17,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 18,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 19,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }, {
                            _id: 20,
                            title: 'Рождественское, часть 1',
                            titleMediaType: 0,
                            titleMedia: 'https://www.youtube.com/embed/eGWwHABmdOo',
                            titleDetails: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            images: ['http://i.imgur.com/pbramIa.jpg'],
                            videos: ['https://www.youtube.com/watch?feature=player_embedded&v=eGWwHABmdOo'],
                            content: "\u041F\u0440\u0430\u0437\u0434\u043D\u0438\u043A\u0438 \u043D\u0430 \u043D\u043E\u0441\u0443, \u043D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u043D\u043E\u044F\u0431\u0440\u044C. \u0421\u0430\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0437\u0430\u0434\u0443\u043C\u044B\u0432\u0430\u0442\u044C \u0436\u0435\u043B\u0430\u043D\u0438\u044F.\n\u0412\u0441\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0432\u0438\u0434\u0435\u043E \u044D\u0442\u043E\u0433\u043E \u043C\u0443\u043B\u0442\u0444\u0438\u043B\u044C\u043C\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442\u0435 \u043D\u0430 \u043A\u0430\u043D\u0430\u043B\u0435 \u0432 \u043F\u043B\u0435\u0439\u043B\u0438\u0441\u0442\u0435 \"\u0420\u043E\u0436\u0434\u0435\u0441\u0442\u0432\u0435\u043D\u0441\u043A\u043E\u0435\"\n\u0412\u0435\u0441\u044C \u043C\u0443\u043B\u044C\u0442\u0444\u0438\u043B\u044C\u043C \u043E\u0431\u0435\u0449\u0430\u043B \u0431\u044B\u0442\u044C \u0433\u043E\u0442\u043E\u0432\u044B\u043C \u043A 5 \u044F\u043D\u0432\u0430\u0440\u044F.",
                            contentHtml: '',
                            created: new Date('2015-12-20'),
                            updated: new Date('2015-12-24')
                        }
                    ],
                    total: 20
                };
                describe('20 items total, 2 items per page, odd visible pages greater then 1 (5 - default)', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 1st page', function (done) {
                        listPager.currentPage = 1;
                        listPager.ngOnChanges();
                        expect(listPager.pagesTotal).toBe(10);
                        expect(listPager.visiblePages.length).toBe(5);
                        expect(listPager.visiblePages[0]).toBe(1);
                        expect(listPager.visiblePages[4]).toBe(5);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 4rd page', function (done) {
                        listPager.currentPage = 4;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(5);
                        expect(listPager.visiblePages[0]).toBe(2);
                        expect(listPager.visiblePages[4]).toBe(6);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 9th page', function (done) {
                        listPager.currentPage = 9;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(5);
                        expect(listPager.visiblePages[0]).toBe(6);
                        expect(listPager.visiblePages[4]).toBe(10);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                });
                describe('20 items total, 2 items per page, even visible pages greater then 1 (4)', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                        listPager.visiblePagesMax = 4;
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 1st page', function (done) {
                        listPager.currentPage = 1;
                        listPager.ngOnChanges();
                        expect(listPager.pagesTotal).toBe(10);
                        expect(listPager.visiblePages.length).toBe(4);
                        expect(listPager.visiblePages[0]).toBe(1);
                        expect(listPager.visiblePages[3]).toBe(4);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 4rd page', function (done) {
                        listPager.currentPage = 4;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(4);
                        expect(listPager.visiblePages[0]).toBe(3);
                        expect(listPager.visiblePages[3]).toBe(6);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 9th page', function (done) {
                        listPager.currentPage = 9;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(4);
                        expect(listPager.visiblePages[0]).toBe(7);
                        expect(listPager.visiblePages[3]).toBe(10);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                });
                describe('20 items total, 2 items per page, even visible pages greater then 1 (2)', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                        listPager.visiblePagesMax = 2;
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 1st page', function (done) {
                        listPager.currentPage = 1;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(2);
                        expect(listPager.visiblePages[0]).toBe(1);
                        expect(listPager.visiblePages[1]).toBe(2);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 4rd page', function (done) {
                        listPager.currentPage = 4;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(2);
                        expect(listPager.visiblePages[0]).toBe(4);
                        expect(listPager.visiblePages[1]).toBe(5);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 9th page', function (done) {
                        listPager.currentPage = 9;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(2);
                        expect(listPager.visiblePages[0]).toBe(9);
                        expect(listPager.visiblePages[1]).toBe(10);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                });
                describe('20 items total, 2 items per page, single visible page', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                        listPager.visiblePagesMax = 1;
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 1st page', function (done) {
                        listPager.currentPage = 1;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(1);
                        expect(listPager.visiblePages[0]).toBe(1);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 4rd page', function (done) {
                        listPager.currentPage = 4;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(1);
                        expect(listPager.visiblePages[0]).toBe(4);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                    it('should update visible pages and pages total when ngOnChanges called - 9th page', function (done) {
                        listPager.currentPage = 9;
                        listPager.ngOnChanges();
                        expect(listPager.visiblePages.length).toBe(1);
                        expect(listPager.visiblePages[0]).toBe(9);
                        expect(listPager.pagesTotal).toBe(10);
                        done();
                    });
                });
                describe('go next', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                    });
                    it('should increase current page if have more pages', function (done) {
                        listPager.currentPage = 5;
                        listPager.onPageChange.subscribe(function (page) {
                            expect(page).toEqual(6);
                            done();
                        });
                        listPager.ngOnChanges();
                        listPager.goToNext();
                    });
                    it('should not increase current page if no more pages', function (done) {
                        listPager.currentPage = 10;
                        listPager.onPageChange.subscribe(function (page) {
                            expect(true).toEqual(false);
                            done();
                        });
                        listPager.ngOnChanges();
                        listPager.goToNext();
                        expect(listPager.currentPage).toBe(10);
                        done();
                    });
                });
                describe('go prev', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                    });
                    it('should decrease current page if have more pages', function (done) {
                        listPager.currentPage = 5;
                        listPager.onPageChange.subscribe(function (page) {
                            expect(page).toEqual(4);
                            done();
                        });
                        listPager.ngOnChanges();
                        listPager.goToPrev();
                    });
                    it('should not decrease current page if no more pages', function (done) {
                        listPager.currentPage = 1;
                        listPager.onPageChange.subscribe(function (page) {
                            expect(true).toEqual(false);
                            done();
                        });
                        listPager.ngOnChanges();
                        listPager.goToPrev();
                        expect(listPager.currentPage).toBe(1);
                        done();
                    });
                });
                describe('go to page', function () {
                    var listPager = new pager_component_1.Pager();
                    beforeEach(function () {
                        listPager.items = page.items.slice(0, 2);
                        listPager.itemsTotal = page.total;
                        listPager.itemsPerPage = 2;
                        listPager.currentPage = 1;
                        listPager.ngOnChanges();
                    });
                    it('should set current page if page is valid', function (done) {
                        listPager.onPageChange.subscribe(function (page) {
                            expect(page).toEqual(7);
                            done();
                        });
                        listPager.goToPage(7);
                    });
                    it('should not set current page is greater then right bound', function (done) {
                        listPager.onPageChange.subscribe(function (page) {
                            expect(true).toEqual(false);
                            done();
                        });
                        listPager.goToPage(11);
                        expect(listPager.currentPage).toBe(1);
                        done();
                    });
                    it('should not set current page is less then left bound', function (done) {
                        listPager.onPageChange.subscribe(function (page) {
                            expect(true).toEqual(false);
                            done();
                        });
                        listPager.goToPage(0);
                        expect(listPager.currentPage).toBe(1);
                        done();
                    });
                    it('should not set current page is not a number', function (done) {
                        listPager.onPageChange.subscribe(function (page) {
                            expect(true).toEqual(false);
                            done();
                        });
                        listPager.goToPage('a');
                        expect(listPager.currentPage).toBe(1);
                        done();
                    });
                });
            });
        }
    }
});
//# sourceMappingURL=pager.component.spec.js.map